WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
DMA_HANDLE _dmaHandle;
uint16_t *_dmaAdcBuf;     // This will contain ADC values (0-4095)

// These are user provided values that must be persisted.
double *_userVoltageResultBuf;
static uint32_t _userGpioXferCount;

static bool _stageOneConfigDone;
static bool _meadowAdcUserInit;
static bool _meadowAdcRegInit;
static double _doubVrefInCal;
static sem_t _waitTillDoneSem;

#if defined CONFIG_ADC_TESTS
static int _noChangeCnt;
#endif

// /************************************************************************************
//  * Private Function Prototypes
//  ************************************************************************************/

static int meadow_adc_hardware_initialize(void);
static void meadow_adc_turn_on(void);
static int meadow_adc_chan_from_pinid(uint32_t pinId, uint32_t *adcInputChan);
static int meadow_adc_fill_seq_chan(uint32_t *regval, uint32_t seqRegMaxGpios,
          uint32_t initRegShift, uint8_t *userGpioList);
static int meadow_adc_read_injected_temp_vref(uint16_t *adcTempReading, uint16_t *adcVrefInCal);
static int meadow_adc_read_injected_vbat(uint16_t *adcBatteryReading);
static int meadow_adc_injected_adc_cleanup(void);
static int meadow_adc_convert_adc_to_voltage(uint16_t adcValue, double *convertedVoltage);
static void meadow_adc_check_first_func_call(void);
static int meadow_adc_config_sequence_regs(uint32_t userGpioXferCount, uint8_t *userGpioList);

/************************************************************************************
 * Private Functions
 ************************************************************************************/
// DMA ISR
static void meadow_adc_dma_isr(DMA_HANDLE handle, uint8_t status,
            FAR void *arg)
{
  uint32_t regval;
  // uint32_t baseADCAddr = (uint32_t)arg;
  // static int execCnt = 0;

  // Without this call the buffer's data is usually not correct
  up_invalidate_dcache((uintptr_t)_dmaAdcBuf,
                       (uintptr_t)_dmaAdcBuf + MEADOW_ADC_MAX_DMA_BUFFER_SIZE);

  // The DMA controller hardware can be programmed to call for the following
  // Discription        Event Flag    Enable control bit
  // -----------        ----------    ------------------
  // Half-transfer          HTIF            HTIE
  // Transfer complete      TCIF            TCIE
  // Transfer error         TEIF            TEIE
  // FIFO overrun/underrun  FEIF            FEIE
  // Direct mode error      DMEIF           DMEIE

  // Note: The interrupt has already been handled in the STM32_DMA_LISR_OFFSET
  // or STM32_DMA_HISR_OFFSET registers by the Nuttx code in stm32_dma.c This
  // function stm32_dmainterrupt() in nuttx/arch/arm/src/stm32/stm32_dma_v2.c,
  // is the function whose call that got us here.
  // The interrupt values are in the 8 bit 'status' field. The fields can be
  // found in: nuttx/arch/arm/src/stm32f7/chip/stm32f76xx77xx_dma.h

#if defined CONFIG_ADC_TESTS
  if(status == 0)
  {
    syslog(1, "DMA ISR No Interrupts\n");
    return;
  }
  // Bit 0: Stream FIFO error interrupt flag
  if((status & DMA_STREAM_FEIF_BIT) != 0)
  {
    syslog(1, "DMA ISR reason:FIFO error\n");
  }

  // Bit 2: Stream direct mode error interrupt flag
  if((status & DMA_STREAM_DMEIF_BIT) != 0)
  {
    syslog(1, "DMA ISR reason:direct mode error\n");
  }

  // Bit 3: Stream Transfer Error flag
  if((status & DMA_STREAM_TEIF_BIT) != 0)
  {
    // CTEIF
    syslog(1, "DMA ISR reason:Transfer Error\n");
  }
  
  //------------------------------------------------------
  // Stream Half Transfer flag
  if((status & DMA_STREAM_HTIF_BIT) != 0)
  {
    // syslog(1, "DMA ISR reason:Half Transfer\n");
  }
#endif

  //------------------------------------------------------
  // Stream Transfer Complete flag
  if((status & DMA_STREAM_TCIF_BIT) != 0)
  {
#if defined CONFIG_ADC_TESTS
    syslog(1, "DMA ISR reason:Transfer Complete\n");
#endif

    // The following test code toggles a GPIO output to cause an ADC analog
    // input's value to also toggle above and below mid-point of Vdd.
#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
    static bool _previousA00High = false;

    // The following code is for testing using the following connections:
    // Connect one end of a 2k2 resistor to ADC_TEST_PIN_CCM_D03_PB8 and the other
    // end connected to two 4k7 resistors. Then connect the free end of one 4k7
    // resistor's to ground and connect the another 4k7 resistor's free end to
    // 3v3, the voltage at the junction, of the 3 resistors, will toggle about
    // 1 volt above and 1 volt below mid-way between ground and 3v3 when
    // ADC_TEST_PIN_CCM_D03_PB8 changes from high to low. With this junction
    // connected to an analog input pin it is easy to prove that all of the
    // ADC values are changing as desired.
    //
    // Look at the ADC value for GPIO_V2_A00_IN4_PA4. It should
    // change on every DMA transfer complete interrupt.
    if(_dmaAdcBuf[0] > 2048)
    {
      // Voltage now above the mid point "high"
      if(_previousA00High)
        _noChangeCnt++;             // Still high, error
      else
        _previousA00High = true;    // Was Low, now high

      // syslog(1, "DMA:Transfer complete - setting GPIO LOW\n");
      stm32_gpiowrite(ADC_TEST_PIN_CCM_D03_PB8, false);
    }
    else
    {
      // Voltage now below the mid-point "low"
      if(! _previousA00High)
        _noChangeCnt++;             // Still low, error
      else
         _previousA00High = false;   // Was high, now low

      // syslog(1, "DMA:Transfer complete - setting GPIO HIGH\n");
      stm32_gpiowrite(ADC_TEST_PIN_CCM_D03_PB8, true);
   }
#endif

    // DMA2's SxCR register's will need to be re-enabled after each
    // conversion. This is because it's cleared whenever an a DMA transfer
    // has been completed.
    regval  = getreg32(STM32_DMA2_S0CR);
    regval |= DMA_SCR_EN;
    putreg32(regval, STM32_DMA2_S0CR);

