WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
    ret = meadow_adc_fill_seq_chan(&regval, regCount, ADC_SQR3_SQ1_SHIFT, userGpioList);
    if(ret < 0)
      return ret;    // Error
  }
  putreg32(regval, STM32_ADC1_SQR3);

  syslog(1, "SEQ_2-initial transfer count:%lu\n", regCount);
  // Sequence Register 2 - ADC channels 7-12
  regval = getreg32(STM32_ADC1_SQR2);
  regval &= ADC_SQR2_RESERVED;   // Clear all SQR Bits
  if(remainingCnt > 0)
  {
    if(remainingCnt >= MEADOW_ADC_SEQ_3_REGISTER_TOTAL)
    {
      regCount = MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
      remainingCnt -= MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
    }
    else
    {
      regCount = remainingCnt;
      remainingCnt = 0;
    }

    ret = meadow_adc_fill_seq_chan(&regval, regCount, ADC_SQR3_SQ1_SHIFT, userGpioList);
    if(ret < 0)
      return ret;    // Error
  }

  putreg32(regval, STM32_ADC1_SQR2);
 
  syslog(1, "SEQ_1-initial transfer count:%lu\n", remainingCnt);
  // Sequence Register 1 - ADC channels 13-16
  regval = getreg32(STM32_ADC1_SQR1);
  regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
  if(remainingCnt > 0)
  {
    if(remainingCnt >= MEADOW_ADC_SEQ_3_REGISTER_TOTAL)
    {
      regCount = MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
      remainingCnt -= MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
    }
    else
    {
      regCount = remainingCnt;
      remainingCnt = 0;
    }

    ret = meadow_adc_fill_seq_chan(&regval, regCount, ADC_SQR3_SQ1_SHIFT, userGpioList);
    if(ret < 0)
      return ret;    // Error
  }

  // Last set the total number of transfers, also in TM32_ADC1_SQR1
  regval |= ((userGpioXferCount - 1) << ADC_SQR1_L_SHIFT);
  putreg32(regval, STM32_ADC1_SQR1);

  return OK;
}

//-----------------------------------------------------------------------
#if defined CONFIG_ADC_TESTS
// Only for TESTING
static void adc_test_display_basic_adc_regs(uint32_t baseADCAddr)
{
  syslog(1, "SR:  0x%08x CR1:  0x%08x CR2:  0x%08x\n",
        getreg32(baseADCAddr + STM32_ADC_SR_OFFSET),
        getreg32(baseADCAddr + STM32_ADC_CR1_OFFSET),
        getreg32(baseADCAddr + STM32_ADC_CR2_OFFSET));

  syslog(1, "SQR1: 0x%08x SQR2: 0x%08x SQR3: 0x%08x\n",
        getreg32(baseADCAddr + STM32_ADC_SQR1_OFFSET),
        getreg32(baseADCAddr + STM32_ADC_SQR2_OFFSET),
        getreg32(baseADCAddr + STM32_ADC_SQR3_OFFSET));

  syslog(1, "CCR:  0x%08x\n", getreg32(STM32_ADC_CCR));
}

static void adc_test_display_basic_dma_regs(void)
{
  syslog(1, "S0CR:  0x%08x  S0NDTR: 0x%08x\n",
        getreg32(STM32_DMA2_S0CR),
        getreg32(STM32_DMA2_S0NDTR));

  syslog(1, "S0PAR: 0x%08x  S0M0AR: 0x%08x S0M1AR: 0x%08x\n",
        getreg32(STM32_DMA2_S0PAR),
        getreg32(STM32_DMA2_S0M0AR),
        getreg32(STM32_DMA2_S0M1AR));
}
#endif

//======================================================================
// Using injection get the adc value (0-4095) for temp and vbat
int meadow_adc_read_injected_temp_vref(uint16_t *adcTempReading, uint16_t *adcVrefInCal)
{
  uint32_t regval;

  // (--) Why not only set one, why require both?
  if(adcTempReading == NULL || adcVrefInCal == NULL)
  {
    return -EINVAL;   // Invalid argument
  }

  // CCR setup to read Temperature & Vref
  regval = getreg32(STM32_ADC_CCR);
  regval |= ADC_CCR_TSVREFE;        // 1=enable temperature sensor and reference
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel
  putreg32(regval, STM32_ADC_CCR);

  // Injection Sequence Register - set ADC input at 18 since ADC_IN18 is used
  // by temperature and vbat depending on eht value of TSVREFE
  // Note: for 2 injected conversions the first is from JSQ3 and the second
  // from JSQ4 (see Ref Man 15.13.12)
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);
  regval &= 0x003fffff;   // Clear all JSQR Bits
  // Note: These may look wrong but are correct.
  regval |= (18 << ADC_JSQR_JSQ4_SHIFT);    // ADC_IN18 - Vsense (temp or vbat)
  regval |= (17 << ADC_JSQR_JSQ3_SHIFT);    // ADC_IN17 - Vrefint
  // And set the length to 1 to indicate 2 analog inputs
  regval |= (1 << ADC_JSQR_JL_SHIFT);
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);

  // Start ADC via Control Register 2 (CR2) - Start the ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  // regval |= ADC_CR2_ADON;           // Must be set 
  // putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  // usleep(10 * 1000);
  // JSWSTART cannot be set if ADON is not set
  regval |= ADC_CR2_JSWSTART;       // Start injection ADC
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // (--) CAN THIS TIME BE SHORTENED???  // COULD USE INTERRUPT
  usleep(5 * 1000);    // Wait till next tick

  // Read the Vsense (temperature) and Vrefint
  *adcTempReading = getreg16(STM32_ADC1_BASE + STM32_ADC_JDR2_OFFSET);
  *adcVrefInCal   = getreg16(STM32_ADC1_BASE + STM32_ADC_JDR1_OFFSET);

syslog(1, "-->> Found rawTemp:%u, rawVref:%u\n", *adcTempReading, *adcVrefInCal);

  // Remove configuration 
  int ret = meadow_adc_injected_adc_cleanup();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Vbat Conversion Error. ret:%d\n", ret);
    return ret;
  }

  return ret;
}

//======================================================================
// This will read the raw ADC value for Vbat
int meadow_adc_read_injected_vbat(uint16_t *adcBatteryReading)
{
  uint32_t regval;

  // Injection Sequence Register - set ADC input at 18 since ADC_IN18 is used
  // by vbat
  // Setup to read Vbat
  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;     // 0=disable temperature sensor and ref
  regval |= ADC_CCR_VBATE;        // 1=enable vbat channel
  putreg32(regval, STM32_ADC_CCR);

  // Note for a single conversion the data is from JSQ4 (see Ref Man 15.13.12)
  // ADC sampling time reading the temperature is 10usec (data sheet Table 78)
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);
  regval &= 0x003fffff;   // Clear all JSQR Bits
  regval |= (18 << ADC_JSQR_JSQ4_SHIFT);           // ADC_IN18 - Vbat
  // And set the length to 0 to indicate 1 input
  regval |= (0 << ADC_JSQR_JL_SHIFT);
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);

