WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // Set ADON to turn on this ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Wait a bit
  usleep(400);
}

//================================================================
// Start ADC
static void meadow_adc_start_single_cycle(void)
{
  uint32_t regval;

  // Enable DMA
  regval  = getreg32(STM32_DMA2_S0CR);
  regval |= DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

  // Initiate the ADC conversion
  regval  = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_SWSTART;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
}

//================================================================
// Initialize DMA
static void meadow_adc_dma_initialize(void)
{
  uint32_t regval;

  // Using Nuttx DMA to handle ADC DMA
  _dmaHandle = stm32_dmachannel(DMAMAP_ADC1_1);

  // Configure the DMA SCR (Stream Control Register) values
  regval = getreg32(STM32_DMA2_S0CR);
  regval |=  DMA_SCR_MSIZE_16BITS;  // Size of memory transfer
  regval |= DMA_SCR_PSIZE_16BITS;   // Size of peripheral transfer
  // Memory increment mode. 0=mem addr is fixed, 1=mem addr increments
  regval |= DMA_SCR_MINC;           // Mem Increment
  regval |= DMA_SCR_DIR_P2M;        // Direction 0=Perph->Mem

  // SxNDTR is set by Nuttx
  stm32_dmasetup(_dmaHandle,
                 STM32_ADC1_BASE + STM32_ADC_DR_OFFSET, // Peripheral addr
                 (uint32_t) _dmaAdcBuf,     // Destination buffer
                 _userGpioXferCount,        // number to transfers
                 regval);

  // Provides DMA callback information
  // void *arg will be returned via callback to ISR
  // true/false for half buffer callback as well as full buffer.
  // But doesn't seem to honor 'false' 1/2 callbacks are still made
  stm32_dmastart(_dmaHandle, meadow_adc_dma_isr,
            (void *)STM32_ADC1_BASE, false);
}

//================================================================
// Call all the sub-initialization functions. This function prepares the ADC
// to do analog conversion.
// This only needs to be called once
int meadow_adc_hardware_initialize(void)
{
  int ret;
  uint16_t adcTempReading;    // Value not used
  uint16_t adcVrefInCal;
  static bool adcInitFirstTime = true;

#if defined CONFIG_ADC_TESTS
  syslog(1, "Entered meadow_adc_hardware_initialize()\n"); usleep(20 * 1000);
#endif

  if(adcInitFirstTime)
  {
    adcInitFirstTime = false;

#if defined CONFIG_ADC_TESTS
    _noChangeCnt = 0;
#endif
  }
  else
  {
    syslog(LOG_WARNING, "Only initialize once\n");
    return -EALREADY;
  }

  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, meadow_adc_conversion_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(1, "Error calling irq_attach\n");
    return ret;
  }

  ret = meadow_adc_stage_one_init();
  if(ret < 0)
  {
    syslog(1, "Error calling meadow_adc_stage_one_init\n"); usleep(20 * 1000);
    return ret;
  }

  meadow_adc_turn_on();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);

  // Note: ADC + DMA won't start until meadow_adc_start_single_cycle() is called

  // We need to do the following before we can calculate any results.
  // Note: this doesn't use DMA, instead it uses the ADC's injected mode.
  ret = meadow_adc_read_injected_temp_vref(&adcTempReading, &adcVrefInCal);
  if(ret < 0)
  {
    syslog(LOG_ERR, "Initial Temp/Cal Ref Conversion Error. ret:%d\n");
    return ret;
  }

  // Set the global calibration value as this will be used later
  _doubVrefInCal = (double)adcVrefInCal;

  // Set the flag indicating that this initialzation has been done
  _stageOneConfigDone = true;

  return OK;
}

//=========================================================
// To get the most best result we'll use the following calculation taken
// from http://efton.sk/STM32/STM32_VREF.pdf.
int meadow_adc_convert_adc_to_voltage(uint16_t adcValue, double *convertedVoltage)
{
  double calRefVal_CAL  = (double) getreg16(MEADOW_ADC_VREFINT_CAL_ADDR);
  double voltage = (MEADOW_ADC_VOLTAGE_ADC_CAL_TAKEN * (double)adcValue * calRefVal_CAL + \
      (_doubVrefInCal * MEADOW_ADC_MAX_ADC_COUNT_DOUBLE / 2.0)) / \
      (_doubVrefInCal * MEADOW_ADC_MAX_ADC_COUNT_DOUBLE);

  // Don't know the cause but, the voltage returned is exactly 0.50 volts
  // too high, from 0 - 3.3.
  *convertedVoltage = voltage - 0.50;

  syslog(1, "--++>> value (adc):%04u, voltage:%.3f\n", adcValue, *convertedVoltage);
  return OK;
}

//=========================================================
// Most public functions call this first.
void meadow_adc_check_first_func_call()
{
  static bool firstCallFirstTime = false;

  if(! firstCallFirstTime)
  {
    firstCallFirstTime = true;
    
    // Global initiation
    _stageOneConfigDone = false;
    _meadowAdcUserInit = false;
    _doubVrefInCal = 0.0;
    return;
  }
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// This function can handle as few as 1 GPIO and as many as 16 GPIOs with a
// buffer with space for all 16.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          double *resultBuffer)
{
  int ret;
  uint32_t gpioListOff;
  uint32_t mapOff = 0;

  // This is probably not a needed function after all. Since it only
  // makes sense for 2 public function to be called this one and the
  // one to read the vbat and temp
  meadow_adc_check_first_func_call();

#if defined CONFIG_ADC_TESTS
  syslog(1, "meadow_adc_configure() gpioCount:%lu, resultBuffer:%p\n",
            gpioCount, resultBuffer);
#endif

  // Check for valid and reasonable input parameters
  if(_meadowAdcUserInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:There is already an active configuration.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  if(resultBuffer == NULL)
  {
    syslog(1, "%s@%d-Error:resultBuffer is NULL\n",
              __FILE__, __LINE__);
    return -EINVAL;   // Invalid argument
  }
  
  // Verify GPIO list is valid
  for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  {
    // Look for matching port/pin in the list
    for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
    {
      if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
        break;   // Found-it's connected to the ADC
    }

