WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
    // Did we go through the entire list and not find a match?
    if(mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
    {
      syslog(LOG_INFO, "GPIO:0x%02x (P%c%d) not connected to ADC\n", gpioList[gpioListOff],
                  (gpioList[gpioListOff] >> 4) + 'A', gpioList[gpioListOff] & 0x0f);
      return -EINVAL;   // Invalid argument
    }
  }

  // Save needed user parameters
  _userGpioXferCount = gpioCount;
  _userVoltageResultBuf = resultBuffer;
  _meadowAdcUserInit = true;

  // Signaling semaphore
  sem_init(&_waitTillDoneSem, 0, 0);
  sem_setprotocol(&_waitTillDoneSem, SEM_PRIO_NONE);  

  // Do before configuration
  _dmaAdcBuf = kmm_malloc(MEADOW_ADC_MAX_DMA_BUFFER_SIZE);
  if(_dmaAdcBuf == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Error:Buffer space not available\n",
                __FILE__, __LINE__);
    return -ENOMEM;   // Out of memory
  }

  memset(_dmaAdcBuf, 0, MEADOW_ADC_MAX_DMA_BUFFER_SIZE);
  _dmaHandle = NULL;

  // There are 3 initialization steps to fully initialize the ADC for analog
  // GPIO data conversion. The first of these can be done at an earlier time
  // as it's needed for reading the internal MCU temperature and battery
  // voltage.
  if(!_stageOneConfigDone)
  {
    ret = meadow_adc_hardware_initialize();
    if(ret < 0)
    {
      syslog(LOG_ERR, "Initialization failed. ret:%d\n", ret);
      return ret;
    }
  }

  ret = meadow_adc_config_sequence_regs(gpioCount, gpioList);
  if(ret < 0)
  {
    syslog(LOG_ERR, "Initialization failed. ret:%d\n", ret);
    return ret;
  }

  meadow_adc_dma_initialize();

#if defined CONFIG_ADC_TESTS
  syslog(1, "Post configuration register values:\n");
  adc_test_display_basic_adc_regs(STM32_ADC1_BASE);
  adc_test_display_basic_dma_regs();
#endif

  return OK;
}

//=========================================================
// This public function will return the values for Vbat and Vtemp from the
// internal STM32F7 chip. The internal sersors have calibration values written
// into the chip at the time of manufacturing. This function will use these
// values to provide the most accurate possible information to the caller.
//
// Quote from Ref Man 15.10
// "The temperature sensor output voltage changes linearly with temperature.
// The offset of this linear function depends on each chip due to process
// variation (up to 45°C from one chip to another).
// The internal temperature sensor is more suited for applications that detect
// temperature variations instead of absolute temperatures. If accurate
// temperature reading is required, an external temperature sensor should be
// used"
int meadow_adc_read_temp_vbat(double *batteryVoltage, double *tempValue)
{
  int ret;
  uint16_t adcTempReading;
  uint16_t adcBatteryReading;
  uint16_t adcVrefInCal;

  meadow_adc_check_first_func_call();

  // Any need to do stage 1 configuration here?
  // Has the initial configuration been done already?
  if(!_stageOneConfigDone)
  {
    ret = meadow_adc_hardware_initialize();
    if(ret < 0)
    {
      syslog(LOG_ERR, "Initialization failed. ret:%d\n", ret);
      return ret;
    }
  }

  ret = meadow_adc_read_injected_temp_vref(&adcTempReading, &adcVrefInCal);
  if(ret < 0)
  {
    syslog(LOG_ERR, "Temperature Conversion Error. ret:%d\n", ret);
    return ret;
  }

  // Set or refresh the Calibration reference
  if(_doubVrefInCal != (double)adcVrefInCal)
    _doubVrefInCal = (double)adcVrefInCal;

  // From Data Sheet (not Ref Man), temperatures calibration values have been
  // read at 30 and 110 degrees celsius. 
  double calAtDegC30_t1  = 30.0;     // Calibration temperature 1 in DegC
  double calAtDegC110_t2 = 110.0;    // Calibration temperature 2 in DegC
  // Get the STM factory calibration values stored in these registers.
  double calRefVal_CAL  = (double) getreg16(MEADOW_ADC_VREFINT_CAL_ADDR);
  double tempCal1_TEMP1 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL30_ADDR);
  double tempCal2_TEMP2 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL110_ADDR);

  // The adc temperature measurement value (0-4095) needs to be converted to
  // a temperature value. To do the best conversion the information in the
  // Data Sheet needs to be incorporated in the math.
  // The following equation came from http://efton.sk/STM32/STM32_VREF.pdf.
  *tempValue = calAtDegC30_t1 + (calAtDegC110_t2 - calAtDegC30_t1) * \
            ((double)adcTempReading * calRefVal_CAL - \
            tempCal1_TEMP1 * (double)adcVrefInCal) / \
            ((double)adcVrefInCal * (tempCal2_TEMP2 - tempCal1_TEMP1));

  // Now do the same for the battery voltage and internal CAL reference
  ret = meadow_adc_read_injected_vbat(&adcBatteryReading);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Vbat Conversion Error. ret:%d\n", ret);
    return ret;
  }

  // Convert the reading into a voltage value
  ret = meadow_adc_convert_adc_to_voltage(adcBatteryReading, batteryVoltage);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Conversion Cleanup Error. ret:%d\n", ret);
    return ret;
  }

  return OK;
}

//================================================================
// Calling this function will free all the allocations and configurations
// that the current active configuration has changed.
int meadow_adc_unconfigure_active_config()
{
  uint32_t regval;
  
  // Turn off ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Stop DMA
  regval  = getreg32(STM32_DMA2_S0CR);
  regval &= ~DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);
  regval &= ~ADC_CR1_SCAN;           // 1=Scan mode (Scans channels in ADC_SQRx registers)
  regval &= ~ADC_CR1_EOCIE;          // 1=Enable ADC interrupt for EOC (not with DMA)
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_DMA;          // 0=Disable DMA
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

